archives/2024/Results/Verifications/S2427/bottleneck-determination/update_index/threads-36/sysbench.log
$ time sysbench --config-file=sysbench.conf --threads=36 oltp_update_index --tables=32 --table-size=1000000 --db-ps-mode=auto --rand-ty
pe=uniform run
sysbench 1.0.20 (using system LuaJIT 2.1.1700206165)

Running the test with following options:
Number of threads: 36
Report intermediate results every 10 second(s)
Initializing random number generator from current time


Initializing worker threads...

Threads started!

[ 10s ] thds: 36 tps: 5009.56 qps: 5009.56 (r/w/o: 0.00/4890.81/118.75) lat (ms,95%): 11.24 err/s: 0.00 reconn/s: 0.00
[ 20s ] thds: 36 tps: 5348.14 qps: 5348.14 (r/w/o: 0.00/5219.95/128.20) lat (ms,95%): 10.84 err/s: 0.00 reconn/s: 0.00
[ 30s ] thds: 36 tps: 5487.60 qps: 5487.60 (r/w/o: 0.00/5351.00/136.60) lat (ms,95%): 10.27 err/s: 0.00 reconn/s: 0.00
[ 40s ] thds: 36 tps: 5662.45 qps: 5662.45 (r/w/o: 0.00/5527.85/134.60) lat (ms,95%): 9.91 err/s: 0.00 reconn/s: 0.00
[ 50s ] thds: 36 tps: 5577.24 qps: 5577.24 (r/w/o: 0.00/5437.34/139.90) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
[ 60s ] thds: 36 tps: 5362.61 qps: 5362.71 (r/w/o: 0.00/5228.81/133.90) lat (ms,95%): 10.46 err/s: 0.00 reconn/s: 0.00
[ 70s ] thds: 36 tps: 4834.39 qps: 4834.29 (r/w/o: 0.00/4716.49/117.80) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 80s ] thds: 36 tps: 4667.70 qps: 4667.70 (r/w/o: 0.00/4553.20/114.50) lat (ms,95%): 13.95 err/s: 0.00 reconn/s: 0.00
[ 90s ] thds: 36 tps: 4631.77 qps: 4631.77 (r/w/o: 0.00/4515.47/116.30) lat (ms,95%): 14.73 err/s: 0.00 reconn/s: 0.00
[ 100s ] thds: 36 tps: 5574.36 qps: 5574.36 (r/w/o: 0.00/5442.87/131.49) lat (ms,95%): 10.09 err/s: 0.00 reconn/s: 0.00
SQL statistics:
    queries performed:
        read:                            0
        write:                           508899
        other:                           12722
        total:                           521621
    transactions:                        521621 (5215.36 per sec.)
    queries:                             521621 (5215.36 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          100.0117s
    total number of events:              521621

Latency (ms):
         min:                                    1.18
         avg:                                    6.90
         max:                                  413.57
         95th percentile:                       11.45
         sum:                              3599255.23

Threads fairness:
    events (avg/stddev):           14489.4722/46.06
    execution time (avg/stddev):   99.9793/0.00


real    1m40.181s
user    0m8.744s
sys     0m20.429s